

&НаКлиенте
Процедура КомандаРаз(Команда)
	Сообщить("Это от 0");
	Сообщить("Сообщение от 0 через EDT commit");
	Сообщить("Исправление от '' через EDT commit");
	Сообщить("Исправление в разных файлах");
	Сообщатель();
	СообщательДоп();
КонецПроцедуры

&НаКлиенте
Процедура Сообщатель()
	Сообщить("Доп. процедура ХХХХ4 от 0");
КонецПроцедуры

&НаКлиенте
Процедура СообщательДоп()
	Сообщить("Сообщатель Доп GitExt");
КонецПроцедуры

&НаСервере
Процедура ПроцОтПробела()
	Сообщить("Сообщение от ' ' третий заход");
КонецПроцедуры
	
&НаСервере
Процедура ПроцОт0()
	Сообщить("Сообщение от 0 третий заход");
КонецПроцедуры

&НаКлиенте
Процедура Проц2от0()
	Сообщить("Сообщение от 0 -2");
КонецПроцедуры

&НаКлиенте
Процедура Проц2отПробела()
	Сообщить("Сообщение от ' ' -2");
КонецПроцедуры

&НаКлиенте
Процедура Проц4отПробела()
	Сообщить("Сообщение от ' ' -4");
КонецПроцедуры

