

&НаКлиенте
Процедура КомандаОтПробел(Команда)
	Сообщить("Команда от ' '");
КонецПроцедуры



&НаКлиенте
Процедура Сообщатель()
	Сообщить("Доп. процедура ХХХХ4 от 0 22");
КонецПроцедуры

&НаКлиенте
Процедура СообщательДоп()
	Сообщить("Сообщатель Доп GitExt");
КонецПроцедуры

&НаСервере
Процедура ПроцОтПробела()
	Сообщить("Сообщение от ' ' третий заход");
КонецПроцедуры
	
&НаСервере
Процедура ПроцОт0()
	Сообщить("Сообщение от 0 третий заход");
КонецПроцедуры


&НаКлиенте
Процедура Проц2отПробела()
	Сообщить("Сообщение от ' ' -2");
КонецПроцедуры

&НаКлиенте
Процедура Проц3от0()
	Сообщить("Сообщение от 0 -3");
КонецПроцедуры

&НаКлиенте
Процедура Проц4отПробела()
	Сообщить("Сообщение от ' ' -4");
КонецПроцедуры

